; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj8 - airport
	obj1 obj9 - city
	obj2 obj7 - airplane
	obj3 obj4 obj5 obj6 obj12 obj13 obj14 obj15 - package
	obj10 - location
	obj11 obj16 - truck
)

(:init
	(at obj5 obj0)
	(at obj12 obj0)
	(at obj11 obj0)
	(at obj7 obj0)
	(at obj16 obj8)
	(at obj3 obj0)
	(in-city obj8 obj9)
	(at obj14 obj0)
	(at obj2 obj0)
	(at obj15 obj0)
	(at obj13 obj0)
	(at obj4 obj0)
	(at obj6 obj0)
	(in-city obj0 obj1)
	(in-city obj10 obj9)
)

(:goal (and
	(at obj14 obj8)
	(at obj13 obj8)
	(at obj4 obj8)
	(at obj5 obj8)
	(at obj6 obj8)
	(at obj12 obj8)
	(at obj15 obj8)
	(at obj3 obj8)
))
)

; plan
1. (load obj7 obj6 obj0)
   deleted: (at obj6 obj0)
   added: (in obj6 obj7)
   goals met: 0 of 8
2. (load obj7 obj5 obj0)
   deleted: (at obj5 obj0)
   added: (in obj5 obj7)
   goals met: 0 of 8
3. (load obj7 obj4 obj0)
   deleted: (at obj4 obj0)
   added: (in obj4 obj7)
   goals met: 0 of 8
4. (load obj7 obj3 obj0)
   deleted: (at obj3 obj0)
   added: (in obj3 obj7)
   goals met: 0 of 8
5. (load obj7 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj7)
   goals met: 0 of 8
6. (load obj7 obj14 obj0)
   deleted: (at obj14 obj0)
   added: (in obj14 obj7)
   goals met: 0 of 8
7. (load obj7 obj13 obj0)
   deleted: (at obj13 obj0)
   added: (in obj13 obj7)
   goals met: 0 of 8
8. (load obj7 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj7)
   goals met: 0 of 8
9. (fly obj7 obj0 obj8)
   deleted: (at obj7 obj0)
   added: (at obj7 obj8)
   goals met: 0 of 8
10. (unload obj7 obj6 obj8)
   deleted: (in obj6 obj7)
   added: (at obj6 obj8)
   goals met: 1 of 8
11. (unload obj7 obj5 obj8)
   deleted: (in obj5 obj7)
   added: (at obj5 obj8)
   goals met: 2 of 8
12. (unload obj7 obj4 obj8)
   deleted: (in obj4 obj7)
   added: (at obj4 obj8)
   goals met: 3 of 8
13. (unload obj7 obj3 obj8)
   deleted: (in obj3 obj7)
   added: (at obj3 obj8)
   goals met: 4 of 8
14. (unload obj7 obj15 obj8)
   deleted: (in obj15 obj7)
   added: (at obj15 obj8)
   goals met: 5 of 8
15. (unload obj7 obj14 obj8)
   deleted: (in obj14 obj7)
   added: (at obj14 obj8)
   goals met: 6 of 8
16. (unload obj7 obj13 obj8)
   deleted: (in obj13 obj7)
   added: (at obj13 obj8)
   goals met: 7 of 8
17. (unload obj7 obj12 obj8)
   deleted: (in obj12 obj7)
   added: (at obj12 obj8)
   goals met: 8 of 8
